{
  "backend/main.mo": "Motoko backend defining anime entries with color palettes, seeding initial data, and storing them in a map with incremental IDs.",
  "feature_evidence.json": "Report mapping implemented features to source files, components, and test IDs with associated confidence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all frontend files including pages, components, hooks, and config.",
  "frontend/index.css": "Empty placeholder CSS file.",
  "frontend/index.html": "Basic HTML shell defining root element and loading the React entry script.",
  "frontend/src/App.tsx": "Root React component enforcing dark mode and routing between the landing page and gallery page.",
  "frontend/src/components/animations/AbstractAnimationCanvas.tsx": "Canvas component that renders animated genre‑based presets with resize handling and reduced‑motion support.",
  "frontend/src/components/animations/presets.ts": "Collection of canvas animation preset renderers including waves, particles, glitch, inks, gradients, and streaks.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright and creator credit.",
  "frontend/src/components/gallery/AnimePoster.tsx": "Lazy‑loaded poster component with fade‑in effect, error fallback, and loading placeholder.",
  "frontend/src/components/gallery/AnimeSection.tsx": "Full‑screen anime section combining background animation, poster, and text content with intersection‑based reveal.",
  "frontend/src/components/gallery/GlassPanel.tsx": "Reusable glass‑style wrapper component applying shared translucent panel styling.",
  "frontend/src/components/landing/AmbientParticlesCanvas.tsx": "Canvas component rendering drifting particles with motion and density adjusted by pointer type and reduced-motion preference.",
  "frontend/src/components/landing/LetterByLetterTitle.tsx": "Animated title that reveals characters sequentially unless reduced motion is preferred, then shows full text instantly.",
  "frontend/src/components/landing/ParallaxLayers.tsx": "Wraps children in a parallax container that shifts based on mouse position unless reduced motion is enabled.",
  "frontend/src/components/landing/ScrollToEnterPrompt.tsx": "Displays a 'Scroll to Enter' label and a bouncing arrow unless reduced motion is preferred.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAnimeList.ts": "Fetches the anime list from the backend actor, initializing the backend if the list is empty.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity login, stored identity, and auth state.",
  "frontend/src/hooks/useIsCoarsePointer.ts": "Detects whether the device uses a coarse pointer via a media query listener.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Tracks the user's reduced-motion preference using a media query listener.",
  "frontend/src/index.css": "Tailwind base with custom color tokens, typography, and component styles including glass panels and cinematic text.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity providers before rendering the root component.",
  "frontend/src/pages/GalleryPage.tsx": "Loads and displays the anime archive, showing loading, error, or empty states before rendering sections and footer.",
  "frontend/src/pages/LandingPage.tsx": "Landing screen with animated visuals, parallax, title animation, and a button to navigate to the gallery.",
  "frontend/src/types/anime.ts": "Re‑exports AnimeEntry and ColorPalette types from the backend.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, radii, shadows, and custom keyframes, with plugins for typography, animations, and container queries.",
  "project_state.json": "Project state file describing ANIMEXIS goals, architecture notes, known issues, and a list of existing feature requirements with versions."
}